driver-tests/bpelse/TerminationHandler/TerminationHandlerJbi/src/jbiServiceUnits/TerminationHandlerBpel/DefaultTH_Compensate_NestedScope/IOWSDL8.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="IOWSDL8" targetNamespace="http://j2ee.netbeans.org/wsdl/IOWSDL8"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://j2ee.netbeans.org/wsdl/IOWSDL8">
    <types/>
    <message name="IOWSDL8OperationRequest">
        <part name="InputPart" type="xsd:string"/>
    </message>
    <message name="IOWSDL8OperationReply">
        <part name="OutputPart" type="xsd:string"/>
    </message>
    <portType name="IOWSDL8PortType">
        <wsdl:operation name="IOWSDL8Operation">
            <wsdl:input name="input1" message="tns:IOWSDL8OperationRequest"/>
            <wsdl:output name="output1" message="tns:IOWSDL8OperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="IOWSDL8Binding" type="tns:IOWSDL8PortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="IOWSDL8Operation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/IOWSDL8"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/IOWSDL8"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="IOWSDL8Service">
        <wsdl:port name="IOWSDL8Port" binding="tns:IOWSDL8Binding">
            <soap:address location="http://localhost:${HttpDefaultPort}/TerminationHandlerBpel/ExplicitTH_NormalActivity/IOWSDL8Service/IOWSDL8Port"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="IOWSDL8Plink">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="IOWSDL8PortTypeRole" portType="tns:IOWSDL8PortType"/>
    </plnk:partnerLinkType>
</definitions>
