driver-tests/bpelse/TerminationHandler/TerminationHandlerJbi/test/DefaultTH_Compensate_NestedScope/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:iow="http://j2ee.netbeans.org/wsdl/IOWSDL8">
  <soapenv:Body>
    <iow:IOWSDL8Operation>
      <InputPart>Test2</InputPart>
    </iow:IOWSDL8Operation>
  </soapenv:Body>
</soapenv:Envelope>